# -*- coding: utf-8 -*-
import KBEngine
from KBEDebug import *
from interfaces.GameObj import GameObj

class card_10000174(GameObj):
	#卡牌名称：负伤剑圣
	#卡牌描述：<b>战吼：</b>对自身造成4点伤害。
	def __init__(self):
		GameObj.__init__(self)

	#--------------------------------------------------------------------------------------------
	#                              Callbacks
	#--------------------------------------------------------------------------------------------

	def battleCry(self,targetID,selfPos):
		self.causeDamage(self.id,4)
	#--------------------------------------------------------------------------------------------
	#                              Effect
	#--------------------------------------------------------------------------------------------
	